In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({
       'A':[1,2,3],
        'B':[10,20,30]
})

df2=pd.DataFrame({
        'C':[4,5,6],
        'D':[40,50,60]
    
})
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [3]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [6]:
df3=pd.DataFrame({
       'A':[1,2,3],
        'B':[10,20,30]},
    index=['a','b','c']
)
df3

   A   B
a  1  10
b  2  20
c  3  30

In [7]:
df3.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [14]:
df4=pd.DataFrame({
       'C':[4,5],
        'D':[40,50]},
    index=['a','b']
)
df4

   C   D
a  4  40
b  5  50

In [15]:
df3.join(df4)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [21]:
df3.join(df4,how='outer')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50